DRuffer/coinForth/amforth-5.8/msp430/devices/msp430f1611/msp430f1611.inc
#define IE2                  0x0001    /* Interrupt Enable 2 */
#define U1IE                IE2       /* UART1 Interrupt Enable Register */
#define URXIE1              (0x10)
#define UTXIE1              (0x20)

#define IFG2                 0x0003    /* Interrupt Flag 2 */
#define U1IFG               IFG2      /* UART1 Interrupt Flag Register */
#define URXIFG1             (0x10)
#define UTXIFG1             (0x20)

#define ME2                  0x0005    /* Module Enable 2 */
#define U1ME                ME2       /* UART1 Module Enable Register */
#define URXE1               (0x10)
#define UTXE1               (0x20)
#define USPIE1              (0x10)

/************************************************************
* WATCHDOG TIMER
************************************************************/
#define __MSP430_HAS_WDT__            /* Definition to show that Module is available */

#define WDTCTL               0x0120    /* Watchdog Timer Control */
/* The bit names have been prefixed with "WDT" */
#define WDTIS0              (0x0001)
#define WDTIS1              (0x0002)
#define WDTSSEL             (0x0004)
#define WDTCNTCL            (0x0008)
#define WDTTMSEL            (0x0010)
#define WDTNMI              (0x0020)
#define WDTNMIES            (0x0040)
#define WDTHOLD             (0x0080)

#define WDTPW               (0x5A00)

/* WDT-interval times [1ms] coded with Bits 0-2 */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MDLY_32         (WDTPW+WDTTMSEL+WDTCNTCL)                         /* 32ms interval (default) */
#define WDT_MDLY_8          (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS0)                  /* 8ms     " */
#define WDT_MDLY_0_5        (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1)                  /* 0.5ms   " */
#define WDT_MDLY_0_064      (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1+WDTIS0)           /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ADLY_1000       (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL)                 /* 1000ms  " */
#define WDT_ADLY_250        (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS0)          /* 250ms   " */
#define WDT_ADLY_16         (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1)          /* 16ms    " */
#define WDT_ADLY_1_9        (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0)   /* 1.9ms   " */
/* Watchdog mode -> reset after expired time */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MRST_32         (WDTPW+WDTCNTCL)                                  /* 32ms interval (default) */
#define WDT_MRST_8          (WDTPW+WDTCNTCL+WDTIS0)                           /* 8ms     " */
#define WDT_MRST_0_5        (WDTPW+WDTCNTCL+WDTIS1)                           /* 0.5ms   " */
#define WDT_MRST_0_064      (WDTPW+WDTCNTCL+WDTIS1+WDTIS0)                    /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ARST_1000       (WDTPW+WDTCNTCL+WDTSSEL)                          /* 1000ms  " */
#define WDT_ARST_250        (WDTPW+WDTCNTCL+WDTSSEL+WDTIS0)                   /* 250ms   " */
#define WDT_ARST_16         (WDTPW+WDTCNTCL+WDTSSEL+WDTIS1)                   /* 16ms    " */
#define WDT_ARST_1_9        (WDTPW+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0)            /* 1.9ms   " */

/* INTERRUPT CONTROL */
/* These two bits are defined in the Special Function Registers */
/* #define WDTIE               0x01 */
/* #define WDTIFG              0x01 */

/************************************************************
* HARDWARE MULTIPLIER
************************************************************/
#define __MSP430_HAS_MPY__            /* Definition to show that Module is available */

#define MPY                  0x0130    /* Multiply Unsigned/Operand 1 */
#define MPYS                 0x0132    /* Multiply Signed/Operand 1 */
#define MAC                  0x0134    /* Multiply Unsigned and Accumulate/Operand 1 */
#define MACS                 0x0136    /* Multiply Signed and Accumulate/Operand 1 */
#define OP2                  0x0138    /* Operand 2 */
#define RESLO                0x013A    /* Result Low Word */
#define RESHI                0x013C    /* Result High Word */
#define SUMEXT               0x013E    /* Sum Extend */

/************************************************************
* DIGITAL I/O Port1/2
************************************************************/
#define __MSP430_HAS_PORT1__          /* Definition to show that Module is available */
#define __MSP430_HAS_PORT2__          /* Definition to show that Module is available */

#define P1IN                 0x0020    /* Port 1 Input */
#define P1OUT                0x0021    /* Port 1 Output */
#define P1DIR                0x0022    /* Port 1 Direction */
#define P1IFG                0x0023    /* Port 1 Interrupt Flag */
#define P1IES                0x0024    /* Port 1 Interrupt Edge Select */
#define P1IE                 0x0025    /* Port 1 Interrupt Enable */
#define P1SEL                0x0026    /* Port 1 Selection */

#define P2IN                 0x0028    /* Port 2 Input */
#define P2OUT                0x0029    /* Port 2 Output */
#define P2DIR                0x002A    /* Port 2 Direction */
#define P2IFG                0x002B    /* Port 2 Interrupt Flag */
#define P2IES                0x002C    /* Port 2 Interrupt Edge Select */
#define P2IE                 0x002D    /* Port 2 Interrupt Enable */
#define P2SEL                0x002E    /* Port 2 Selection */

/************************************************************
* DIGITAL I/O Port3/4
************************************************************/
#define __MSP430_HAS_PORT3__          /* Definition to show that Module is available */
#define __MSP430_HAS_PORT4__          /* Definition to show that Module is available */

#define P3IN                 0x0018    /* Port 3 Input */
#define P3OUT                0x0019    /* Port 3 Output */
#define P3DIR                0x001A    /* Port 3 Direction */
#define P3SEL                0x001B    /* Port 3 Selection */

#define P4IN                 0x001C    /* Port 4 Input */
#define P4OUT                0x001D    /* Port 4 Output */
#define P4DIR                0x001E    /* Port 4 Direction */
#define P4SEL                0x001F    /* Port 4 Selection */

/************************************************************
* DIGITAL I/O Port5/6
************************************************************/
#define __MSP430_HAS_PORT5__          /* Definition to show that Module is available */
#define __MSP430_HAS_PORT6__          /* Definition to show that Module is available */

#define P5IN                 0x0030    /* Port 5 Input */
#define P5OUT                0x0031    /* Port 5 Output */
#define P5DIR                0x0032    /* Port 5 Direction */
#define P5SEL                0x0033    /* Port 5 Selection */

#define P6IN                 0x0034    /* Port 6 Input */
#define P6OUT                0x0035    /* Port 6 Output */
#define P6DIR                0x0036    /* Port 6 Direction */
#define P6SEL                0x0037    /* Port 6 Selection */

/************************************************************
* USART
************************************************************/

