DRuffer/coinForth/amforth-5.8/msp430/devices/msp430f1611/msp430f1611.inc
#define CACTL1               0x0059    /* Comparator A Control 1 */
#define CACTL2               0x005A    /* Comparator A Control 2 */
#define CAPD                 0x005B    /* Comparator A Port Disable */

#define CAIFG               (0x01)    /* Comp. A Interrupt Flag */
#define CAIE                (0x02)    /* Comp. A Interrupt Enable */
#define CAIES               (0x04)    /* Comp. A Int. Edge Select: 0:rising / 1:falling */
#define CAON                (0x08)    /* Comp. A enable */
#define CAREF0              (0x10)    /* Comp. A Internal Reference Select 0 */
#define CAREF1              (0x20)    /* Comp. A Internal Reference Select 1 */
#define CARSEL              (0x40)    /* Comp. A Internal Reference Enable */
#define CAEX                (0x80)    /* Comp. A Exchange Inputs */

#define CAREF_0             (0x00)    /* Comp. A Int. Ref. Select 0 : Off */
#define CAREF_1             (0x10)    /* Comp. A Int. Ref. Select 1 : 0.25*Vcc */
#define CAREF_2             (0x20)    /* Comp. A Int. Ref. Select 2 : 0.5*Vcc */
#define CAREF_3             (0x30)    /* Comp. A Int. Ref. Select 3 : Vt*/

#define CAOUT               (0x01)    /* Comp. A Output */
#define CAF                 (0x02)    /* Comp. A Enable Output Filter */
#define P2CA0               (0x04)    /* Comp. A Connect External Signal to CA0 : 1 */
#define P2CA1               (0x08)    /* Comp. A Connect External Signal to CA1 : 1 */
#define CACTL24             (0x10)
#define CACTL25             (0x20)
#define CACTL26             (0x40)
#define CACTL27             (0x80)

#define CAPD0               (0x01)    /* Comp. A Disable Input Buffer of Port Register .0 */
#define CAPD1               (0x02)    /* Comp. A Disable Input Buffer of Port Register .1 */
#define CAPD2               (0x04)    /* Comp. A Disable Input Buffer of Port Register .2 */
#define CAPD3               (0x08)    /* Comp. A Disable Input Buffer of Port Register .3 */
#define CAPD4               (0x10)    /* Comp. A Disable Input Buffer of Port Register .4 */
#define CAPD5               (0x20)    /* Comp. A Disable Input Buffer of Port Register .5 */
#define CAPD6               (0x40)    /* Comp. A Disable Input Buffer of Port Register .6 */
#define CAPD7               (0x80)    /* Comp. A Disable Input Buffer of Port Register .7 */

/************************************************************
* ADC12
************************************************************/
#define __MSP430_HAS_ADC12__          /* Definition to show that Module is available */

#define ADC12CTL0            0x01A0    /* ADC12 Control 0 */
#define ADC12CTL1            0x01A2    /* ADC12 Control 1 */
#define ADC12IFG             0x01A4    /* ADC12 Interrupt Flag */
#define ADC12IE              0x01A6    /* ADC12 Interrupt Enable */
#define ADC12IV              0x01A8    /* ADC12 Interrupt Vector Word */

#define ADC12MEM           (0x0140)  /* ADC12 Conversion Memory */
#define ADC12MEM0            0x0140    /* ADC12 Conversion Memory 0 */
#define ADC12MEM1            0x0142    /* ADC12 Conversion Memory 1 */
#define ADC12MEM2            0x0144    /* ADC12 Conversion Memory 2 */
#define ADC12MEM3            0x0146    /* ADC12 Conversion Memory 3 */
#define ADC12MEM4            0x0148    /* ADC12 Conversion Memory 4 */
#define ADC12MEM5            0x014A    /* ADC12 Conversion Memory 5 */
#define ADC12MEM6            0x014C    /* ADC12 Conversion Memory 6 */
#define ADC12MEM7            0x014E    /* ADC12 Conversion Memory 7 */
#define ADC12MEM8            0x0150    /* ADC12 Conversion Memory 8 */
#define ADC12MEM9            0x0152    /* ADC12 Conversion Memory 9 */
#define ADC12MEM10           0x0154    /* ADC12 Conversion Memory 10 */
#define ADC12MEM11           0x0156    /* ADC12 Conversion Memory 11 */
#define ADC12MEM12           0x0158    /* ADC12 Conversion Memory 12 */
#define ADC12MEM13           0x015A    /* ADC12 Conversion Memory 13 */
#define ADC12MEM14           0x015C    /* ADC12 Conversion Memory 14 */
#define ADC12MEM15           0x015E    /* ADC12 Conversion Memory 15 */

#define ADC12MCTL          (0x0080)  /* ADC12 Memory Control */
#define ADC12MCTL0           0x0080    /* ADC12 Memory Control 0 */
#define ADC12MCTL1           0x0081    /* ADC12 Memory Control 1 */
#define ADC12MCTL2           0x0082    /* ADC12 Memory Control 2 */
#define ADC12MCTL3           0x0083    /* ADC12 Memory Control 3 */
#define ADC12MCTL4           0x0084    /* ADC12 Memory Control 4 */
#define ADC12MCTL5           0x0085    /* ADC12 Memory Control 5 */
#define ADC12MCTL6           0x0086    /* ADC12 Memory Control 6 */
#define ADC12MCTL7           0x0087    /* ADC12 Memory Control 7 */
#define ADC12MCTL8           0x0088    /* ADC12 Memory Control 8 */
#define ADC12MCTL9           0x0089    /* ADC12 Memory Control 9 */
#define ADC12MCTL10          0x008A    /* ADC12 Memory Control 10 */
#define ADC12MCTL11          0x008B    /* ADC12 Memory Control 11 */
#define ADC12MCTL12          0x008C    /* ADC12 Memory Control 12 */
#define ADC12MCTL13          0x008D    /* ADC12 Memory Control 13 */
#define ADC12MCTL14          0x008E    /* ADC12 Memory Control 14 */
#define ADC12MCTL15          0x008F    /* ADC12 Memory Control 15 */

/* ADC12CTL0 */
#define ADC12SC             (0x001)   /* ADC12 Start Conversion */
#define ENC                 (0x002)   /* ADC12 Enable Conversion */
#define ADC12TOVIE          (0x004)   /* ADC12 Timer Overflow interrupt enable */
#define ADC12OVIE           (0x008)   /* ADC12 Overflow interrupt enable */
#define ADC12ON             (0x010)   /* ADC12 On/enable */
#define REFON               (0x020)   /* ADC12 Reference on */
#define REF2_5V             (0x040)   /* ADC12 Ref 0:1.5V / 1:2.5V */
#define MSC                 (0x080)   /* ADC12 Multiple SampleConversion */
#define SHT00               (0x0100)  /* ADC12 Sample Hold 0 Select 0 */
#define SHT01               (0x0200)  /* ADC12 Sample Hold 0 Select 1 */
#define SHT02               (0x0400)  /* ADC12 Sample Hold 0 Select 2 */
#define SHT03               (0x0800)  /* ADC12 Sample Hold 0 Select 3 */
#define SHT10               (0x1000)  /* ADC12 Sample Hold 0 Select 0 */
#define SHT11               (0x2000)  /* ADC12 Sample Hold 1 Select 1 */
#define SHT12               (0x4000)  /* ADC12 Sample Hold 2 Select 2 */
#define SHT13               (0x8000)  /* ADC12 Sample Hold 3 Select 3 */
#define MSH                 (0x080)

